#+TITLE: Org-mode notes
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="http://thomasf.github.io/solarized-css/solarized-dark.min.css" />
* Inline LaTeX
  Equation:

  \begin{equation}
  x=\sqrt{b}
  \end{equation}

  Inline math:
   
  If $a^2=b$ and \( b=2 \), then the solution must be
  either $$ a=+\sqrt{2} $$ or \[ a=-\sqrt{2} \]

  Align equations:

  \begin{align*}
  1 + 2&= 3\\
  1 &= 3 - 2
  \end{align*}

* Output LaTex from code blocks
  #+BEGIN_SRC ipython :session :results output drawer :exports both
  from sympy import *
  x = Symbol("x")
  a = 1/((x+2)*(x+1))
  print("$${}$$".format(latex(a)))
  #+END_SRC

  #+RESULTS:
  :RESULTS:
  $$\frac{1}{\left(x + 1\right) \left(x + 2\right)}$$
  :END:
* Archive done tasks
  #+BEGIN_SRC elisp
    (defun org-archive-done-tasks ()
      (interactive)
      (org-map-entries
       (lambda ()
         (org-archive-subtree)
         (setq org-map-continue-from (outline-previous-heading)))
       "/DONE" 'file))
  #+END_SRC
